<!-- dflook/terraform-github-actions {"workspace":"closed-outputs","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"3a4ecbf1f306ef73159b5d80429cbd6258499aa36a6f6430c8e30a970249b266","plan_job_ref":"Job Test plan target and replace #370 at https://github.com/dflook/terraform-github-actions/actions/runs/7131911867","plan_hash":"a339f9fcba7b10632cd90a5c084db4f2dbce67c226a293cd262cdfdf1892a593","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __closed-outputs__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "cEqKEoWawt" -> (known after apply)
  ~ foreach = "1KOGWPRhzE" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #370](https://github.com/dflook/terraform-github-actions/actions/runs/7131911867)